In [1]:
import pandas as pd 
import sqlite3

In [2]:
dir_db = 'sql-murder-mystery.db'
conn = sqlite3.connect(dir_db)
cursor = conn.cursor()

In [6]:
query = """
SELECT *
FROM Crime_scene_report
WHERE date=="20180115" AND type == "murder" and city== "SQL City"
"""
cursor = conn.cursor()
mi_query = cursor.execute(query)
mi_query.fetchall()

[(20180115,
  'murder',
  'Security footage shows that there were 2 witnesses. The first witness lives at the last house on "Northwestern Dr". The second witness, named Annabel, lives somewhere on "Franklin Ave".',
  'SQL City')]

In [12]:
query = """
SELECT *
FROM person p 
WHERE address_street_name == "Northwestern Dr" and address_number == "4919"
"""

pd.read_sql_query(query, conn)

,id,name,license_id,address_number,address_street_name,ssn
0,14887,Morty Schapiro,118009,4919,Northwestern Dr,111564949

In [23]:
query = """
SELECT *
FROM person p 
WHERE address_street_name == "Franklin Ave" and name LIKE "Annabel%"
"""

pd.read_sql_query(query, conn)

,id,name,license_id,address_number,address_street_name,ssn
0,16371,Annabel Miller,490173,103,Franklin Ave,318771143

In [17]:
query = """
SELECT *
FROM interview
WHERE person_id == 14887  
"""

cursor = conn.cursor()
mi_query = cursor.execute(query)
mi_query.fetchall()

[(14887,
  'I heard a gunshot and then saw a man run out. He had a "Get Fit Now Gym" bag. The membership number on the bag started with "48Z". Only gold members have those bags. The man got into a car with a plate that included "H42W".')]

In [24]:
query = """
SELECT *
FROM interview
WHERE person_id == 16371  
"""

cursor = conn.cursor()
mi_query = cursor.execute(query)
mi_query.fetchall()

[(16371,
  'I saw the murder happen, and I recognized the killer from my gym when I was working out last week on January the 9th.')]

In [34]:
query = """
SELECT *
FROM get_fit_now_member m
JOIN get_fit_now_check_in ci ON m.Id = ci.membership_id 
JOIN person p ON m.person_id = p.Id
JOIN drivers_license dl ON p.license_id = dl.Id
WHERE m.membership_status == "gold" and  ci.membership_id LIKE '48Z%' and dl.plate_number LIKE "%H42W%"
"""

pd.read_sql_query(query, conn)

,id,person_id,name,membership_start_date,membership_status,membership_id,check_in_date,check_in_time,check_out_time,id,...,ssn,id,age,height,eye_color,hair_color,gender,plate_number,car_make,car_model
0,48Z55,67318,Jeremy Bowers,20160101,gold,48Z55,20180109,1530,1700,67318,...,871539279,423327,30,70,brown,brown,male,0H42W2,Chevrolet,Spark LS

In [33]:
query = """
SELECT *
FROM get_fit_now_check_in
WHERE check_in_date == 20180109 and  membership_id LIKE '48Z%'
"""
pd.read_sql_query(query, conn)

  membership_id  check_in_date  check_in_time  check_out_time
0         48Z7A       20180109           1600            1730
1         48Z55       20180109           1530            1700